---
kind: property
id: P:Autodesk.Revit.DB.InternalDefinition.VariesAcrossGroups
source: html/089c01dd-030f-2621-cf30-0e60cb7c5868.htm
---
# Autodesk.Revit.DB.InternalDefinition.VariesAcrossGroups Property

Whether or not the parameter values can vary across group members.

## Syntax (C#)
```csharp
public bool VariesAcrossGroups { get; }
```